# Introduction to pandas

This notebook will introduce you to the `pandas` library in Python, which is widely used for data manipulation and analysis. We will cover the basics of DataFrames and Series, slicing and indexing, handling missing values, and concatenating and appending DataFrames.

## Importing pandas

First, we need to import the `pandas` library. By convention, it is imported as `pd`.

In [1]:
import pandas as pd

## Loading Data

We will use an air quality dataset from a CSV file. Let's load the dataset into a DataFrame.

In [8]:
url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/air_quality_no2.csv'
air_quality = pd.read_csv(url)

## Understanding DataFrames

A DataFrame is a two-dimensional, size-mutable, and heterogeneous tabular data structure with labeled axes (rows and columns). Let's inspect the first few rows of our dataset using the `head` method.

In [9]:
air_quality.head()

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN

In [10]:
air_quality.tail()

                 datetime  station_antwerp  station_paris  station_london
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

We can get a summary of the DataFrame using the `info` method.

In [12]:
air_quality.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   datetime         1035 non-null   object
 1   station_antwerp  95 non-null     float64
 2   station_paris    1004 non-null   float64
 3   station_london   969 non-null    float64
dtypes: float64(3), object(1)
memory usage: 32.5+ KB

The `describe` method provides statistical information about the numerical columns.

In [14]:
# discraibe
air_quality.describe()

       station_antwerp  station_paris  station_london
count        95.000000    1004.000000      969.000000
mean         25.778947      27.740538       24.777090
std          12.682019      15.285746       11.214377
min           7.500000       0.000000        0.000000
25%          16.750000      16.500000       19.000000
50%          23.000000      24.150000       25.000000
75%          34.500000      35.925000       31.000000
max          74.500000      97.000000       97.000000

## Series

A Series is a one-dimensional array-like object containing an array of data and an associated array of data labels, called its index. Each column in a DataFrame is a Series. Let's look at the 'station_antwerp' column.

In [21]:
print(air_quality.head())
antwerp_series = air_quality["station_antwerp"]
print("-----------")
print(antwerp_series.head())

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN
-----------
0     NaN
1    50.5
2    45.0
3     NaN
4     NaN
Name: station_antwerp, dtype: float64

## Slicing and Indexing

### Selecting Columns

You can select a column by passing the column name as a string to the DataFrame.

In [22]:
paris_series =  air_quality["station_paris"]
print(paris_series.head())

0     NaN
1    25.0
2    27.7
3    50.4
4    61.9
Name: station_paris, dtype: float64

### Selecting Multiple Columns

You can select multiple columns by passing a list of column names.

In [24]:
# 'station_antwerp', 'station_paris', 'station_london' cols
stations =  air_quality[['station_antwerp', 'station_paris', 'station_london']]
print(stations.head())

   station_antwerp  station_paris  station_london
0              NaN            NaN            23.0
1             50.5           25.0            19.0
2             45.0           27.7            19.0
3              NaN           50.4            16.0
4              NaN           61.9             NaN

### Selecting Rows by Index

Use the `iloc` method to select rows by index.

In [31]:
# at iloc ----> []

first_row = air_quality.iloc[0]
print(first_row)

datetime           2019-05-07 02:00:00
station_antwerp                    NaN
station_paris                      NaN
station_london                    23.0
Name: 0, dtype: object

### Selecting Rows by Label

Use the `loc` method to select rows by label.

In [30]:
row_label = air_quality.loc[0]
print(row_label)

datetime           2019-05-07 02:00:00
station_antwerp                    NaN
station_paris                      NaN
station_london                    23.0
Name: 0, dtype: object

In [40]:
# Select rows with index labels 0 to 4 inclusive
selected_rows = air_quality.loc[0:4]
selected_rows

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN

In [41]:
selected_rows = air_quality.iloc[0:4]
selected_rows

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0

In [43]:
# Select rows with specific index labels (1, 3, 5)
mask=[1, 3, 5]
specific_rows = air_quality.loc[mask]
specific_rows

              datetime  station_antwerp  station_paris  station_london
1  2019-05-07 03:00:00             50.5           25.0            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0
5  2019-05-07 07:00:00              NaN           72.4            26.0

### Boolean Indexing

You can use boolean indexing to filter rows based on a condition.

In [34]:
mask=air_quality["station_paris"]>40

In [38]:
high_no2 = air_quality.loc[air_quality['station_paris']>40]
print(high_no2.head())

              datetime  station_antwerp  station_paris  station_london
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN
5  2019-05-07 07:00:00              NaN           72.4            26.0
6  2019-05-07 08:00:00              NaN           77.7            32.0
7  2019-05-07 09:00:00              NaN           67.9            32.0

In [36]:
# station_paris > 40
mask= air_quality["station_paris"]>40
#high_no2 =  air_quality[air_quality["station_paris"]>40]
high_no2 =  air_quality[mask]
print(high_no2.head())

              datetime  station_antwerp  station_paris  station_london
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN
5  2019-05-07 07:00:00              NaN           72.4            26.0
6  2019-05-07 08:00:00              NaN           77.7            32.0
7  2019-05-07 09:00:00              NaN           67.9            32.0

## Handling Missing Values

### Detecting Missing Values

You can detect missing values using the `isnull` method.

In [45]:
missing_values = air_quality.isnull()
print(missing_values.head())

   datetime  station_antwerp  station_paris  station_london
0     False             True           True           False
1     False            False          False           False
2     False            False          False           False
3     False             True          False           False
4     False             True          False            True

### Counting Missing Values

You can count the number of missing values in each column using the `sum` method.

In [45]:
missing_values_count =  # TO OD
print(missing_values_count)

datetime             0
station_antwerp    940
station_paris       31
station_london      66
dtype: int64

## Types of missing data
There are three main types of missing data: (1) Missing Completely at Random (MCAR), (2) Missing at Random (MAR), and (3) Missing Not at Random (MNAR).

It is important to have a better understanding of each one for choosing the appropriate methods to handle them. 

### 1) MCAR - Missing completely at random
This happens if all the variables and observations have the `same probability` of being missing. Imagine providing a child with Lego of different colors to build a house. Each Lego represents a piece of information, like shape and color. The child might lose some Legos during the game. These lost legos represent missing information, just like when they canâ€™t remember the shape or the color of the Lego they had. That information was lost randomly, but they do not change the information the child has on the other Legos. 

### 2) MAR - Missing at random
For MAR, the probability of the value being missing is related to the `value of the variable or other variables` in the dataset. This means that `not all the observations and variables have the same chance` of being missing. An example of MAR is a survey in the Data community where data scientists who do not frequently upgrade their skills are more likely not to be aware of new state-of-the-art algorithms or technologies, hence skipping certain questions. The missing data, in this case, is related to how frequently the data scientist upskills.

### 3) MNAR- Missing not at random
MNAR is considered to be the most difficult scenario among the three types of missing data. It is applied when neither MAR nor MCAR apply. In this situation, the probability of being missing is `completely different` for different values of the same variable, and these reasons can be unknown to us. An example of MNAR is a survey about married couples. Couples with a bad relationship might not want to answer certain questions as they might feel embarrassed to do so.

## Dealing with Missing Values

### Dropping Missing Values

You can drop rows or columns with missing values using the `dropna` method.

#### Pros
Straightforward and simple to use.
Beneficial when missing values have no importance. 

#### Cons
Using this approach can lead to information loss, which can introduce bias to the final dataset.</br>
This is not appropriate when the data is not missing completely at random. </br>
Data set with a large proportion of missing value can be significantly decreased, which can impact the result of all statistical analysis on that data set. </br>

In [46]:
air_quality_dropped =  # TO OD
print(air_quality_dropped.head())

               datetime  station_antwerp  station_paris  station_london
1   2019-05-07 03:00:00             50.5           25.0            19.0
2   2019-05-07 04:00:00             45.0           27.7            19.0
25  2019-05-08 03:00:00             23.0           19.6            20.0
26  2019-05-08 04:00:00             20.5           15.3            20.0
49  2019-05-09 03:00:00             20.0           10.6            31.0

### Mean/Median Imputation
These replacement strategies are self-explanatory. Mean and median imputations are respectively used to replace missing values of a given column with the mean and median of the non-missing values in that column. 

`Normal distribution` is the ideal scenario. Unfortunately, it is not always the case. This is where the median imputation can be helpful because `it is not sensitive to outliers`.

### Pros
Simplicity and ease of implementation are some of the benefits of the mean and median imputation. </br>
The imputation is performed using the existing information from the non-missing data; hence `no additional data is required`. </br>
`Mean` and `median` imputation can provide a good estimate of the missing values, `respectively` for normally `distributed` data, and `skewed` data.
### Cons
We `cannot` apply these two strategies to `categorical columns`. They can only work for numerical ones.</br>
Mean imputation is sensitive to outliers and may not be a good representation of the central tendency of the data. Similarly to the mean, the median also may not better represent the central tendency.</br>
Median imputation makes the assumption that the data is missing completely at random (MCAR), which is not always true.

In [51]:
# mean
mean_value =  # TO OD
mean_value

C:\Users\Sars\AppData\Local\Temp\ipykernel_17956\2150476893.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  mean_value = air_quality.mean()

station_antwerp    25.778947
station_paris      27.740538
station_london     24.777090
dtype: float64

In [50]:
mean_imputation =  # TO OD
mean_imputation.head()

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00        25.778947      27.740538        23.00000
1  2019-05-07 03:00:00        50.500000      25.000000        19.00000
2  2019-05-07 04:00:00        45.000000      27.700000        19.00000
3  2019-05-07 05:00:00        25.778947      50.400000        16.00000
4  2019-05-07 06:00:00        25.778947      61.900000        24.77709

In [52]:
# median
median_value =  # TO OD
median_value

C:\Users\Sars\AppData\Local\Temp\ipykernel_17956\3814907334.py:2: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  median_value = air_quality.median()

station_antwerp    23.00
station_paris      24.15
station_london     25.00
dtype: float64

In [53]:
median_imputation =  # TO OD
median_imputation.head()

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00             23.0          24.15            23.0
1  2019-05-07 03:00:00             50.5          25.00            19.0
2  2019-05-07 04:00:00             45.0          27.70            19.0
3  2019-05-07 05:00:00             23.0          50.40            16.0
4  2019-05-07 06:00:00             23.0          61.90            25.0

## Backfill vs. Forward Fill

When dealing with missing data in a time series data, two common strategies for imputation are backfilling and forward filling. These methods involve filling missing values with the most recent non-missing value either from the past (backfill) or from the future (forward fill). Let's explore each method along with their pros and cons.

### Backfill:
Backfilling, also known as backward fill or bfill, involves filling missing values with the next available non-missing value `from the past`. </br>
It propagates the last known value backward through time to fill missing values.

### Forwardfill
Forward filling, also known as forward fill or ffill, involves filling missing values with the most recent non-missing value `from the future`.
It propagates the next known value forward through time to fill missing values.

In [61]:
# Backfilling missing values
backfilled =  # TO OD

backfilled.head()

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00             50.5           25.0            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00             23.0           50.4            16.0
4  2019-05-07 06:00:00             23.0           61.9            26.0

In [59]:
# Forward filling missing values
forwardfilled = # TO OD

forwardfilled.head()

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00             45.0           50.4            16.0
4  2019-05-07 06:00:00             45.0           61.9            16.0

## Concatenating and Appending DataFrames

### Concatenating DataFrames

You can concatenate DataFrames using the `concat` method.

In [63]:
df1 = air_quality.head(3)
df2 = air_quality.tail(3)
concatenated =  # TO OD
concatenated

                 datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

### Appending Rows

You can append rows to a DataFrame using the `append` method.

In [64]:
appended =  # TO OD
print(appended)

                 datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

C:\Users\Sars\AppData\Local\Temp\ipykernel_17956\2655321644.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  appended = df1.append(df2)